app/views/comments/_comment.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                %a{:href => see_user_profile_path(comment.user.id)}
                    - if comment.user.firstname