app/views/posts/index.html.haml

          - if post.user
            - if post.user.firstname
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]