app/controllers/comments_controller.rb

    def create
        @section = Section.find(params[:section_id])
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit(:comment))
        @comment.user_id = current_user.id if current_user
        if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "comments" ("comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "I reply!"], ["post_id", 6], ["created_at", "2016-03-11 20:28:14.133412"], ["updated_at", "2016-03-11 20:28:14.133412"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-03-11 20:32:39.257812"], ["id", 3]]

    def destroy
        @section = Section.find(params[:section_id])
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])
        @comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 6], ["id", 5]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]

    def edit
        @section = Section.find(params[:section_id])
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 6], ["id", 4]]

    def update
        @section = Section.find(params[:section_id])
        @post = Post.find(params[:post_id])
        @comment = @post.comments.find(params[:id])

        if @comment.update(params[:comment].permit(:comment))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 6], ["id", 4]]
UPDATE "comments" SET "comment" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment", "asdaasdad"], ["updated_at", "2016-03-11 20:47:01.495352"], ["id", 4]]