app/controllers/posts_controller.rb

    def create
        @post = current_user.posts.build(post_params)

        if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "my post id"], ["content", "asdsadsa"], ["user_id", 1], ["created_at", "2016-03-11 18:57:44.383700"], ["updated_at", "2016-03-11 18:57:44.383700"]]