app/controllers/users_controller.rb

    def login
      if (params[:username])
        @customer = params[:username]
        if (SignUser.find_by_username(@customer))
---
SELECT  "sign_users".* FROM "sign_users" WHERE "sign_users"."username" = ? LIMIT 1  [["username", "Terminator"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", ""]]

    def homepage
      @id = params[:id]
      puts "the id is"
      puts @id
      @username = SignUser.find_by_id(@id).username
---
SELECT  "sign_users".* FROM "sign_users" WHERE "sign_users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]

    def signup
      if (params[:username])
        @user = SignUser.create!(user_params)
---
INSERT INTO "sign_users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "abcde"], ["password", "12345"], ["created_at", "2016-03-12 02:28:59.371039"], ["updated_at", "2016-03-12 02:28:59.371039"]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "123"], ["password", "1234"], ["created_at", "2016-03-10 21:23:23.778991"], ["updated_at", "2016-03-10 21:23:23.778991"]]